#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-gwYfpyn2u8FQa8Nw

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210630175300092700000001]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-gcp9dahm4c-irntllxe14-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_lambda_function.github: Refreshing state... [id=lambda-github]
aws_lambda_function.auth: Refreshing state... [id=handler]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_iam_role_policy.lambda_invoke: Refreshing state... [id=iam_for_lambda:terraform-20210707172511482600000001]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-gcp9dahm4c-irntllxe14-ANY]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=nn1sip]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.invoke_github will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "invoke_github"  {
      ~ id      = "3874920128" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:InvokeAsync",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:220881534007:function:lambda-github"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - success = true
                }
              - headers    = {
                  - time = "2021-07-07T22:15:08.137Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.lambda_invoke will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_invoke" {
        id     = "iam_for_lambda:terraform-20210707172511482600000001"
        name   = "terraform-20210707172511482600000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:InvokeAsync",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:220881534007:function:lambda-github"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.auth will be updated in-place
  ~ resource "aws_lambda_function" "auth" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
        id                             = "handler"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2021-07-07T22:14:46.967+0000" -> (known after apply)
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "DINr5EMtX2gapsLjxqeY346vjzM98OS8OOen3/w2ntU=" -> "ajIpEpUMHjRcV+Zp+ZbgjSCuCCSlEJzIMyCZsXOdvms="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AUD"                    = "sso-requests"
              - "CONFIGURATION_ENDPOINT" = "https://dev.oidc.gov.bc.ca/auth/realms/onestopauth/.well-known/openid-configuration"
              - "DB_HOSTNAME"            = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              - "DB_NAME"                = "ExampleDB"
              - "DB_PASSWORD"            = (sensitive)
              - "DB_USERNAME"            = (sensitive)
              - "NODE_ENV"               = "production"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
        id                             = "lambda-db"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2021-07-07T22:14:59.770+0000" -> (known after apply)
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "ZIGqLGfN74PmB/hd1+XvZ8ZBHhdV6B0jNDLNQmlPMaE=" -> "UIBsxYGcj/ka3xBDcql7OL0faCLscomQsL1rssoiafc="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DB_HOSTNAME" = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              - "DB_NAME"     = "ExampleDB"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
              - "NODE_ENV"    = "production"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.github will be updated in-place
  ~ resource "aws_lambda_function" "github" {
        id                             = "lambda-github"
      ~ last_modified                  = "2021-07-07T22:14:53.279+0000" -> (known after apply)
      ~ source_code_hash               = "YBV0gWcFhz1HfgJIpLBruPbWTUDDD+EK8xDtDH9yO+4=" -> "J/Y2ldyMIDrXiI8QLu95153TsxQYvyilN+YNCjcYR3o="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.db.aws_rds_cluster.this[0] must be replaced
-/+ resource "aws_rds_cluster" "this" {
      ~ arn                                 = "arn:aws:rds:ca-central-1:220881534007:cluster:aurora-db-postgres" -> (known after apply)
      ~ availability_zones                  = [
          - "ca-central-1a",
          - "ca-central-1b",
          - "ca-central-1d",
        ] -> (known after apply)
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-452PE4EB455G3MAUXCMBSCTBGE" -> (known after apply)
      ~ database_name                       = "ExampleDB" -> "ExampleDB1" # forces replacement
      ~ db_cluster_parameter_group_name     = "default.aurora-postgresql10" -> (known after apply)
      - enabled_cloudwatch_logs_exports     = [] -> null
      ~ endpoint                            = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version                      = "10.14" -> (known after apply)
      ~ hosted_zone_id                      = "Z1JG78A3UK1DU3" -> (known after apply)
      - iam_roles                           = [] -> null
      ~ id                                  = "aurora-db-postgres" -> (known after apply)
      ~ kms_key_id                          = "arn:aws:kms:ca-central-1:220881534007:key/e21a3726-7c61-43d0-b7ee-aa0c37f4b943" -> (known after apply)
      ~ reader_endpoint                     = "" -> (known after apply)
        tags                                = {
            "Terraform" = "true"
        }
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - success = true
        }
      - headers    = {
          - time = "2021-07-07T22:15:08.137Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @jlangy, Action: `pull_request`*